In [ ]:
import pandas as pd

In [ ]:
data={

      'ID': [1,2,3,4,5,6],
      'Name': ['Shreyas','Deepak','Himanshu','Aditya','Rohit','Ameen'],
      'Age' : [25,30,35,40,45,21],
      'Country' : ['Maharashtra','Tamil Nadu','Kerala','Goa','Uttar Pradesh','Madhya Pradesh'],
      'Sales': [200,450,300,800,150,400]

}

In [ ]:
df=pd.DataFrame(data)

print("Orginal Dataset")
print(df)

Orginal Dataset
   ID      Name  Age         Country  Sales
0   1   Shreyas   25     Maharashtra    200
1   2    Deepak   30      Tamil Nadu    450
2   3  Himanshu   35          Kerala    300
3   4    Aditya   40             Goa    800
4   5     Rohit   45   Uttar Pradesh    150
5   6     Ameen   21  Madhya Pradesh    400

In [ ]:
df['Name_Upper']=df['Name'].str.upper()

print("Dataset after adding new column")
print(df[['ID','Name','Name_Upper']])

Dataset after adding new column
   ID      Name Name_Upper
0   1   Shreyas    SHREYAS
1   2    Deepak     DEEPAK
2   3  Himanshu   HIMANSHU
3   4    Aditya     ADITYA
4   5     Rohit      ROHIT
5   6     Ameen      AMEEN

In [ ]:
df_copy1=df.copy()
df_copy2=df.copy()

df_copy1['Sales'] *= 1.1
df_copy2['Age'] += 5

print("\nMulticast (Modified Copies):")
print("Copy 1 (Sales Increased):")
print(df_copy1)
print("\nCopy 2 (Age Increased):")
print(df_copy2)

Multicast (Modified Copies):
Copy 1 (Sales Increased):
   ID      Name  Age         Country  Sales Name_Upper
0   1   Shreyas   25     Maharashtra  220.0    SHREYAS
1   2    Deepak   30      Tamil Nadu  495.0     DEEPAK
2   3  Himanshu   35          Kerala  330.0   HIMANSHU
3   4    Aditya   40             Goa  880.0     ADITYA
4   5     Rohit   45   Uttar Pradesh  165.0      ROHIT
5   6     Ameen   21  Madhya Pradesh  440.0      AMEEN

Copy 2 (Age Increased):
   ID      Name  Age         Country  Sales Name_Upper
0   1   Shreyas   30     Maharashtra    200    SHREYAS
1   2    Deepak   35      Tamil Nadu    450     DEEPAK
2   3  Himanshu   40          Kerala    300   HIMANSHU
3   4    Aditya   45             Goa    800     ADITYA
4   5     Rohit   50   Uttar Pradesh    150      ROHIT
5   6     Ameen   26  Madhya Pradesh    400      AMEEN

In [ ]:
high_sales=df[df['Sales']>300]
low_sales=df[df['Sales']<=300]
print("\nConditional Split:")
print("High Sales:")
print(high_sales)
print("\nLow Sales:")
print(low_sales)

Conditional Split:
High Sales:
   ID    Name  Age         Country  Sales Name_Upper
1   2  Deepak   30      Tamil Nadu    450     DEEPAK
3   4  Aditya   40             Goa    800     ADITYA
5   6   Ameen   21  Madhya Pradesh    400      AMEEN

Low Sales:
   ID      Name  Age        Country  Sales Name_Upper
0   1   Shreyas   25    Maharashtra    200    SHREYAS
2   3  Himanshu   35         Kerala    300   HIMANSHU
4   5     Rohit   45  Uttar Pradesh    150      ROHIT

In [ ]:
agg_df=df.groupby('Country')['Sales'].sum().reset_index()
print("\nAggregation:")
print(agg_df)

Aggregation:
          Country  Sales
0             Goa    800
1          Kerala    300
2  Madhya Pradesh    400
3     Maharashtra    200
4      Tamil Nadu    450
5   Uttar Pradesh    150

In [ ]:
sorted_df=df.sort_values(by='Sales',ascending=False)
print("\nSorted Data:")
print(sorted_df)

Sorted Data:
   ID      Name  Age         Country  Sales Name_Upper
3   4    Aditya   40             Goa    800     ADITYA
1   2    Deepak   30      Tamil Nadu    450     DEEPAK
5   6     Ameen   21  Madhya Pradesh    400      AMEEN
2   3  Himanshu   35          Kerala    300   HIMANSHU
0   1   Shreyas   25     Maharashtra    200    SHREYAS
4   5     Rohit   45   Uttar Pradesh    150      ROHIT

In [ ]:
df['Sales_Category']=df['Sales'].apply(lambda x: 'High' if x>300 else 'Low')
print("\nDerived Column (Sales Category):")
print(df[['ID','Name','Sales','Sales_Category']])

Derived Column (Sales Category):
   ID      Name  Sales Sales_Category
0   1   Shreyas    200            Low
1   2    Deepak    450           High
2   3  Himanshu    300            Low
3   4    Aditya    800           High
4   5     Rohit    150            Low
5   6     Ameen    400           High